0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3U1x7.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>IVC_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>IVC_0</groupName>
			<baseAddress>0x40044000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IN0RANGE</name>
							<description>Input 0 Range. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>6_MA</name>
									<description>Input range is 0-6 mA.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_MA</name>
									<description>Input range is 0-5 mA.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_MA</name>
									<description>Input range is 0-4 mA.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_MA</name>
									<description>Input range is 0-3 mA.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_MA</name>
									<description>Input range is 0-2 mA.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_MA</name>
									<description>Input range is 0-1 mA.</description>
									<value>5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IN1RANGE</name>
							<description>Input 1 Range. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>6_MA</name>
									<description>Input range is 0-6 mA.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_MA</name>
									<description>Input range is 0-5 mA.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_MA</name>
									<description>Input range is 0-4 mA.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_MA</name>
									<description>Input range is 0-3 mA.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_MA</name>
									<description>Input range is 0-2 mA.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_MA</name>
									<description>Input range is 0-1 mA.</description>
									<value>5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C0EN</name>
							<description>Converter 0 Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable IVC channel 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable IVC channel 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C1EN</name>
							<description>Converter 1 Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable IVC channel 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable IVC channel 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>LOCK_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>LOCK_0</groupName>
			<baseAddress>0x40049000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>KEY</name>
					<description>Security Key</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>KEY</name>
							<description>Peripheral Lock Mask Key. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>PERIPHLOCK registers are locked and no valid values have been written to KEY.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERMEDIATE</name>
									<description>PERIPHLOCK registers are locked and the first valid value (0xA5) has been written to KEY.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>PERIPHLOCK registers are unlocked. Any subsequent writes to KEY will lock the interface.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PERIPHLOCK0</name>
					<description>Peripheral Lock Control 0</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>USARTL</name>
							<description>USART/UART Module Lock Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the USART0, USART1, UART0, and UART1 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the USART0, USART1, UART0, and UART1 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPIL</name>
							<description>SPI Module Lock Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the SPI0, SPI1, and SPI2 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the SPI0, SPI1, and SPI2 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2CL</name>
							<description>I2C Module Lock Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the I2C0 and I2C1 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the I2C0 and I2C1 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCAL</name>
							<description>PCA Module Lock Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the EPCA0, PCA0, and PCA1 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the EPCA0, PCA0, and PCA1 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIMERL</name>
							<description>Timer Module Lock Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the TIMER0 and TIMER1 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the TIMER0 and TIMER1 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USBL</name>
							<description>USB Module Lock Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the USB0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the USB0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SARADCL</name>
							<description>SARADC Module Lock Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the SARADC0 and SARADC1 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the SARADC0 and SARADC1 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSGL</name>
							<description>SSG Module Lock Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the SSG0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the SSG0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPL</name>
							<description>Comparator Module Lock Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Comparator 0 and Comparator 1 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Comparator 0 and Comparator 1 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSL</name>
							<description>Capacitive Sensing Module Lock Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Capacitive Sensing (CAPSENSE0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Capacitive Sensing (CAPSENSE0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMIFL</name>
							<description>EMIF Module Lock Enable. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the External Memory Interface (EMIF0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the External Memory Interface (EMIF0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AESL</name>
							<description>AES Module Lock Enable. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the AES0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the AES0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CRCL</name>
							<description>CRC Module Lock Enable. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the CRC0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the CRC0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTCL</name>
							<description>RTC Module Lock Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the RTC0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the RTC0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKRSTL</name>
							<description>Clock Control and Reset Sources Lock Enable. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Clock Control (CLKCTRL) and Reset Sources (RSTSRC) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Clock Control (CLKCTRL) and Reset Sources (RSTSRC) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VMONL</name>
							<description>Voltage Supply Monitor Module Lock Enable. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Voltage Supply Monitor (VMON0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Voltage Supply Monitor (VMON0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDACL</name>
							<description>IDAC Module Lock Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the IDAC0 and IDAC1 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the IDAC0 and IDAC1 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMACTRLL</name>
							<description>DMA Controller Module Lock Enable. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the DMA Controller (DMACTRL0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the DMA Controller (DMACTRL0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMAXBARL</name>
							<description>DMA Crossbar Module Lock Enable. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the DMA Crossbar (DMAXBAR0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the DMA Crossbar (DMAXBAR0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LPTL</name>
							<description>Low Power Timer Module Lock Enable. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Low Power Timer (LPTIMER0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Low Power Timer (LPTIMER0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREFL</name>
							<description>Voltage Reference Module Lock Enable. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Voltage Reference (VREF0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Voltage Reference (VREF0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2SL</name>
							<description>I2S Module Lock Enable. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the I2S0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the I2S0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PLLL</name>
							<description>PLL Module Lock Enable. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the PLL0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the PLL0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTOSCL</name>
							<description>External Oscillator Module Lock Enable. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the External Oscillator (EXTOSC0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the External Oscillator (EXTOSC0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREGL</name>
							<description>Voltage Regulator Module Lock Enable. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Voltage Regulator (VREG0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Voltage Regulator (VREG0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LPOSCL</name>
							<description>Low Power Oscillator Lock Enable. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the Low Power Oscillator (LPOSC0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the Low Power Oscillator (LPOSC0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EVREGL</name>
							<description>External Regulator Module Lock Enable. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the External Regulator (EXTVREG0) Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the External Regulator (EXTVREG0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IVCL</name>
							<description>IVC Module Lock Enable. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the IVC0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the IVC0 Module registers (bits can still be read).</description>
