0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3U1x7.svd
				<register>
					<name>FIFOCN</name>
					<description>FIFO Control</description>
					<addressOffset>0x60</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RCNT</name>
							<description>Receive FIFO Count. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RFTH</name>
							<description>Receive FIFO Threshold. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ONE</name>
									<description>A DMA request or read data request interrupt (RDREQI) is asserted when &gt;= 1 FIFO slot is full.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO</name>
									<description>A DMA request or read data request interrupt (RDREQI) is asserted when &gt;= 2 FIFO slots are full.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FOUR</name>
									<description>A DMA request or read data request interrupt (RDREQ) is asserted when &gt;= 4 FIFO slots are full.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDMAEN</name>
							<description>Receiver DMA Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable receive FIFO DMA requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable receive FIFO DMA requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RFIFOFL</name>
							<description>Receive FIFO Flush. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SET</name>
									<description>Flush the contents of the receive FIFO and any data in the receive shift register.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RFERI</name>
							<description>Receive FIFO Error Interrupt Flag. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A receive FIFO error has not occurred since RFERI was last cleared.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A receive FIFO error occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RSRFULLF</name>
							<description>Receive Shift Register Full Flag. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The receive data shift register is not full.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The receive data shift register is full.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TCNT</name>
							<description>Transmit FIFO Count. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TFTH</name>
							<description>Transmit FIFO Threshold. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ONE</name>
									<description>A DMA request or transmit data request interrupt (TDREQI) is asserted when &gt;= 1 FIFO slot is empty.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO</name>
									<description>A DMA request or transmit data request interrupt (TDREQI) is asserted when &gt;= 2 FIFO slots are empty.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FOUR</name>
									<description>A DMA request or transmit data request interrupt (TDREQ) is asserted when &gt;= 4 FIFO slots are empty.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TDMAEN</name>
							<description>Transmitter DMA Enable. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable transmit FIFO DMA requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable transmit FIFO DMA requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TFIFOFL</name>
							<description>Transmit FIFO Flush. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SET</name>
									<description>Flush the contents of the transmit FIFO. If data is pending in the transmit shift register but a transmit has not begun, the shift register is also flushed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TFERI</name>
							<description>Transmit FIFO Error Interrupt Flag. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A transmit FIFO error has not occurred since TFERI was last cleared.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A transmit FIFO error occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSRFULLF</name>
							<description>Transmit Shift Register Full Flag. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The transmit shift register is not full.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The transmit shift register is full.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<description>FIFO Input/Output Data</description>
					<addressOffset>0x70</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATA</name>
							<description>FIFO Data. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
