0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3U1x7.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>USB_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>USB_0</groupName>
			<baseAddress>0x40018000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USB0_IRQn</name>
				<value>34</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>FADDR</name>
					<description>Function Address</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FADDR</name>
							<description>Function Address. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>FADDRUPD</name>
							<description>Function Address Update. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The last address written to FADDR is in effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The last address written to FADDR is not yet in effect.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>POWER</name>
					<description>Power Control</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000010</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SUSDEN</name>
							<description>Suspend Detection Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable suspend detection. The USB module will ignore suspend signaling on the bus.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable suspend detection. The USB module will enter suspend mode if it detects suspend signalling on the bus.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUSMDF</name>
							<description>Suspend Mode Flag. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The USB module is not in suspend mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The USB module is in suspend mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESUME</name>
							<description>Force Resume. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>STOP</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RSTDETF</name>
							<description>Reset Detect Flag. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Reset signaling is not present on the bus.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Reset signaling detected on the bus.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USBINH</name>
							<description>USB Inhibit. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Enable the USB module.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>USB module inhibited. All USB traffic is ignored.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DITHEN</name>
							<description>USB Dither Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable automatic USB dithering.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable automatic USB dithering.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISOUPDMD</name>
							<description>ISO Update Mode. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SEND_ON_IN</name>
									<description>When software writes IPRDYI = 1, USB will send the packet when the next IN token is received.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SEND_ON_SOF</name>
									<description>When software writes IPRDYI = 1, USB will wait for a SOF token before sending the packet. If an IN token is received before a SOF token, USB will send a zero-length data packet.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IOINT</name>
					<description>IN/OUT Endpoint Interrupt Flags</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EP0I</name>
							<description>Endpoint 0 Interrupt Flag. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: Endpoint 0 interrupt has not occurred. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: Endpoint 0 interrupt occurred. Write: Clear the interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IN1I</name>
							<description>IN Endpoint 1 Interrupt Flag. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: IN Endpoint 1 interrupt has not occurred. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: IN Endpoint 1 interrupt occurred. Write: Clear the interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IN2I</name>
							<description>IN Endpoint 2 Interrupt Flag. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: IN Endpoint 2 interrupt has not occurred. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: IN Endpoint 2 interrupt occurred. Write: Clear the interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IN3I</name>
							<description>IN Endpoint 3 Interrupt Flag. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: IN Endpoint 3 interrupt has not occurred. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: IN Endpoint 3 interrupt occurred. Write: Clear the interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IN4I</name>
							<description>IN Endpoint 4 Interrupt Flag. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: IN Endpoint 4 interrupt has not occurred. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: IN Endpoint 4 interrupt occurred. Write: Clear the interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUT1I</name>
							<description>OUT Endpoint 1 Interrupt Flag. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: OUT Endpoint 1 interrupt has not occurred. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: OUT Endpoint 1 interrupt occurred. Write: Clear the interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUT2I</name>
							<description>OUT Endpoint 2 Interrupt Flag. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: OUT Endpoint 2 interrupt has not occurred. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: OUT Endpoint 2 interrupt occurred. Write: Clear the interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUT3I</name>
							<description>OUT Endpoint 3 Interrupt Flag. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: OUT Endpoint 3 interrupt has not occurred. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: OUT Endpoint 3 interrupt occurred. Write: Clear the interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUT4I</name>
							<description>OUT Endpoint 4 Interrupt Flag. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: OUT Endpoint 4 interrupt has not occurred. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: OUT Endpoint 4 interrupt occurred. Write: Clear the interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CMINT</name>
					<description>Common Interrupt Flags</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SUSI</name>
							<description>Suspend Interrupt Flag. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: Suspend interrupt has not occurred. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: Suspend interrupt occurred. Write: Clear the interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESI</name>
							<description>Resume Interrupt Flag. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: Resume interrupt has not occurred. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: Resume interrupt occurred. Write: Clear the interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RSTI</name>
							<description>Reset Interrupt Flag. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: Reset interrupt has not occurred. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: Reset interrupt occurred. Write: Clear the interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SOFI</name>
							<description>Start of Frame Interrupt Flag. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: SOF interrupt has not occurred. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: SOF interrupt occurred. Write: Clear the interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IOINTE</name>
					<description>IN/OUT Endpoint Interrupt Control</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x001E001F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EP0IEN</name>
							<description>Endpoint 0 Interrupt Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the Endpoint 0 interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the Endpoint 0 interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IN1IEN</name>
							<description>IN Endpoint 1 Interrupt Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the IN Endpoint 1 interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the IN Endpoint 1 interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IN2IEN</name>
							<description>IN Endpoint 2 Interrupt Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the IN Endpoint 2 interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the IN Endpoint 2 interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IN3IEN</name>
							<description>IN Endpoint 3 Interrupt Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the IN Endpoint 3 interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the IN Endpoint 3 interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IN4IEN</name>
							<description>IN Endpoint 4 Interrupt Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the IN Endpoint 4 interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the IN Endpoint 4 interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUT1IEN</name>
							<description>OUT Endpoint 1 Interrupt Enable. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the OUT Endpoint 1 interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the OUT Endpoint 1 interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUT2IEN</name>
							<description>OUT Endpoint 2 Interrupt Enable. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the OUT Endpoint 2 interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the OUT Endpoint 2 interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUT3IEN</name>
							<description>OUT Endpoint 3 Interrupt Enable. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the OUT Endpoint 3 interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the OUT Endpoint 3 interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUT4IEN</name>
							<description>OUT Endpoint 4 Interrupt Enable. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the OUT Endpoint 4 interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the OUT Endpoint 4 interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
