0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3U1x7.svd
				<!--BASEPOINTER_START_3-->
				<register>
					<name>EPMPSIZE_2</name>
					<description>Endpoint Maximum Packet Size</description>
					<addressOffset>0x900</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IMAXP</name>
							<description>IN Maximum Packet Size. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>OMAXP</name>
							<description>OUT Maximum Packet Size. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EPCONTROL_2</name>
					<description>Endpoint Control</description>
					<addressOffset>0x910</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IPRDYI</name>
							<description>IN Packet Ready Indicator. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The packet has been sent or there is an open FIFO slot.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A packet is loaded in the FIFO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IFIFONEF</name>
							<description>IN FIFO Not Empty Flag. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The IN Endpoint FIFO is empty.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The IN Endpoint FIFO contains one or more packets.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IURF</name>
							<description>IN FIFO Underrun Flag. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Underrun has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Underrun occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IFIFOFL</name>
							<description>IN FIFO Flush. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SET</name>
									<description>Flush the IN FIFO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISDSTL</name>
							<description>IN Send Stall. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Stop sending a stall.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Generate a stall.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISTSTLI</name>
							<description>IN Sent Stall Interrupt Flag. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A stall condition has not been sent since this bit was last cleared. Write: Clear the interrupt. </description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: A stall condition has been sent since this bit was last cleared. Write: No effect.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICLRDT</name>
							<description>IN Clear Data Toggle. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_RESET</name>
									<description>Do not reset the IN data toggle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset the IN data toggle.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPLITEN</name>
							<description>FIFO Split Enable. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not split the endpoint FIFO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Split the endpoint FIFO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FDTEN</name>
							<description>Force Data Toggle Enable. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The endpoint data toggle switches only when an ACK is received following a data packet transmission.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The endpoint data toggle is forced to switch after every data packet is transmitted, regardless of ACK reception.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDMAEN</name>
							<description>IN Endpoint DMA Enable. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the DMA request for the IN endpoint.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the DMA request for the IN endpoint.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIRSEL</name>
							<description>Endpoint Direction Select. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>OUT</name>
									<description>Select the endpoint direction as OUT.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IN</name>
									<description>Select the endpoint direction as IN.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IISOEN</name>
							<description>IN Isochronous Transfer Enable. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>BULK_INT</name>
									<description>Configure the endpoint for Bulk/Interrupt transfers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ISO</name>
									<description>Configure the endpoint for Isochronous transfers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTOSETEN</name>
							<description>IN Endpoint IPRDYI Automatic Set Enable. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The IPRDYI bit is not automatically set by hardware.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The IPRDYI bit is automatically set by hardware.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OPRDYI</name>
							<description>OUT Packet Ready. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A data packet is not available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A data packet is available.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OFIFOFF</name>
							<description>OUT FIFO Full. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The OUT endpoint FIFO is not full.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The OUT endpoint FIFO is full.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OORF</name>
							<description>OUT FIFO Overrun Flag. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>No data overrun.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A data packet was lost because of a full FIFO since this flag was last cleared.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ODERRF</name>
							<description>OUT Data Error Flag. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A CRC or bit-stuff error has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A CRC or bit-stuff error occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OFIFOFL</name>
							<description>OUT FIFO Flush. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SET</name>
									<description>Flush the OUT FIFO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSDSTL</name>
							<description>OUT Send Stall. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop sending a stall.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SEND</name>
									<description>Generate a stall.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSTSTLI</name>
							<description>OUT Sent Stall Interrupt Flag. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A stall condition has not been sent since this bit was last cleared. Write: Clear the interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: A stall condition has been sent since this bit was last cleared. Write: No effect.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OCLRDT</name>
							<description>OUT Clear Data Toggle. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_RESET</name>
									<description>Do not reset the OUT data toggle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset the OUT data toggle.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ODMAMD</name>
							<description>OUT Endpoint DMA Mode. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>AUTO_DMA</name>
									<description>Automatic DMA service is requested on the last packet of the transfer until less than four bytes remain in the packet. At this time, an interrupt is generated. The firmware must read or write the last few bytes of the packet, if any remain.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NO_DMA</name>
									<description>No DMA service is requested on the last packet of the transfer. When the DMA recognizes the last packet, an interrupt is generated. The firmware must handle the entirety of the last packet.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ODMAEN</name>
							<description>OUT Endpoint DMA Enable. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the DMA request for the OUT endpoint.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the DMA request for the OUT endpoint.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OISOEN</name>
							<description>OUT Isochronous Transfer Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>BULK_INT</name>
									<description>Configure the endpoint for Bulk/Interrupt transfers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ISO</name>
									<description>Configure the endpoint for Isochronous transfers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTOCLREN</name>
							<description>OUT Endpoint OPRDYI Auto-Clear Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The OPRDYI bit is not automatically cleared by hardware.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The OPRDYI bit is automatically cleared by hardware.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EPCOUNT_2</name>
					<description>Endpoint Data Count</description>
					<addressOffset>0x920</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COUNT</name>
							<description>Endpoint OUT Data Count. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EPFIFO_2</name>
					<description>Endpoint Data FIFO Access</description>
					<addressOffset>0x930</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>FIFO</name>
							<description>Endpoint Data FIFO. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<!--BASEPOINTER_START_4-->
				<register>
					<name>EPMPSIZE_3</name>
					<description>Endpoint Maximum Packet Size</description>
					<addressOffset>0x980</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IMAXP</name>
							<description>IN Maximum Packet Size. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>OMAXP</name>
							<description>OUT Maximum Packet Size. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
